<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<!-- placeholder-3 -->
<details><summary>Plan: 4 to add, 0 to change, 6 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-10T22:14:03Z [(view log)](https://github.com/perchnet/p/actions/runs/16866925153/job/47775095394#step:11:1).
</summary>

```hcl

Error: Null value found in list

  with module.vm_minimal_config.proxmox_virtual_environment_vm.vm,
  on .terraform/modules/vm_minimal_config/modules/vm-clone/main.tf line 102, in resource "proxmox_virtual_environment_vm" "vm":
 102:       keys     = flatten([(var.ci_ssh_key != null ? "${var.ci_ssh_key}" : null), var.ci_ssh_keys])

Null values are not allowed for this attribute value.
[id=2025-08-08T19:17:09Z]
random_id.tailscale_host_suffix: Refreshing state... [id=E1o]
data.onepassword_vault.perchnet_vault: Reading...
module.coreos_metadata.data.http.coreos_stream_metadata: Reading...
onepassword_item.coreos_module_password: Refreshing state... [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/tuxgnqcf7r7hufpglsvwf7sboe]
module.coreos_metadata.data.http.coreos_stream_metadata: Read complete after 0s [id=https://builds.coreos.fedoraproject.org/streams/testing.json]
module.proxmox_images.random_id.image_id["coreos_img"]: Refreshing state... [id=UWA]
module.proxmox_images.random_id.image_id["ubuntu_noble_cloud_image"]: Refreshing state... [id=mn8]
module.proxmox_images.random_id.image_id["debian_trixie"]: Refreshing state... [id=oRA]
module.proxmox_images.random_id.image_id["debian_bookworm"]: Refreshing state... [id=L74]
module.proxmox_images.random_id.image_id["ubuntu_jammy"]: Refreshing state... [id=1KU]
data.onepassword_vault.perchnet_vault: Read complete after 0s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e]
data.onepassword_item.proxmox_ssh: Reading...
data.onepassword_item.github_infra_app: Reading...
data.onepassword_item.proxmox_api: Reading...
data.onepassword_item.tailscale_apikey: Reading...
data.onepassword_item.tailscale_apikey: Read complete after 1s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/cvh7gepgwlnb7yxtkxsvlsokti]
tailscale_tailnet_key.key: Refreshing state... [id=kunJHGm9S711CNTRL]
data.onepassword_item.github_infra_app: Read complete after 1s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/bfyitfe53xaaelfs2kz73nbreq]
data.onepassword_item.proxmox_ssh: Read complete after 1s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/7sa3h66bvyxryglelfxsruzzhu]
module.pkcs8_to_pem.data.external.pkcs8_to_pem: Reading...
data.onepassword_item.proxmox_api: Read complete after 1s [id=vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/cig4t223gv7xmcrzdxtwmtffx4]
github_repository.p_repository: Refreshing state... [id=p]
github_repository_ruleset.p_merge_queue: Refreshing state... [id=6621869]
module.pkcs8_to_pem.data.external.pkcs8_to_pem: Read complete after 0s [id=-]
module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_noble_cloud_image"]: Refreshing state... [id=zssd-files:iso/TFimg_ubuntu-24-9a7f.04-cloudimg-amd64.qcow.img]
module.proxmox_images.proxmox_virtual_environment_download_file.images["debian_bookworm"]: Refreshing state... [id=zssd-files:iso/TFimg_debian-12-nocloud-amd64-2fbe.qcow2.img]
module.proxmox_images.proxmox_virtual_environment_download_file.images["debian_trixie"]: Refreshing state... [id=zssd-files:iso/TFimg_debian-13-genericcloud-amd64-a110.qcow2.img]
module.proxmox_images.proxmox_virtual_environment_download_file.images["coreos_img"]: Refreshing state... [id=zssd-files:iso/TFimg_fedora-coreos-42-5160.20250803.2.0-proxmoxve.x86_64.qcow2.xz.img]
module.ubuntu22.module.cloud_image.proxmox_virtual_environment_download_file.image: Refreshing state... [id=local:iso/ubuntu-22.04-server-cloudimg-amd64.img]
module.proxmox_images.proxmox_virtual_environment_download_file.images["ubuntu_jammy"]: Refreshing state... [id=zssd-files:iso/TFimg_ubuntu-22-d4a5.04-server-cloudimg-amd64.qcow.img]
module.debian13.module.cloud_image.proxmox_virtual_environment_download_file.image: Refreshing state... [id=local:iso/debian-13-generic-amd64.img]
module.coreos-periphery-vm.proxmox_virtual_environment_file.cloud_user_config: Refreshing state... [id=snippets:snippets/120830cf.butane-ci-user-data.ign]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # onepassword_item.coreos_module_password will be destroyed
  # (because onepassword_item.coreos_module_password is not in configuration)
  - resource "onepassword_item" "coreos_module_password" {
      - category = "login" -> null
      - id       = "vaults/xjvmoejfpwbuvwpelaxjicxo3e/items/tuxgnqcf7r7hufpglsvwf7sboe" -> null
      - password = (sensitive value) -> null
      - title    = "coreos-module-password" -> null
      - username = "core" -> null
      - uuid     = "tuxgnqcf7r7hufpglsvwf7sboe" -> null
      - vault    = "xjvmoejfpwbuvwpelaxjicxo3e" -> null

      - password_recipe {
          - digits  = true -> null
          - length  = 40 -> null
          - letters = true -> null
          - symbols = false -> null
        }
    }

  # random_id.tailscale_host_suffix will be destroyed
  # (because random_id.tailscale_host_suffix is not in configuration)
  - resource "random_id" "tailscale_host_suffix" {
      - b64_std     = "E1o=" -> null
      - b64_url     = "E1o" -> null
      - byte_length = 2 -> null
      - dec         = "4954" -> null
      - hex         = "135a" -> null
      - id          = "E1o" -> null
    }

  # tailscale_tailnet_key.key will be destroyed
  # (because tailscale_tailnet_key.key is not in configuration)
  - resource "tailscale_tailnet_key" "key" {
      - created_at    = "2025-08-08T02:16:23Z" -> null
      - ephemeral     = false -> null
      - expires_at    = "2025-08-08T03:16:23Z" -> null
      - expiry        = 3600 -> null
      - id            = "kunJHGm9S711CNTRL" -> null
      - invalid       = true -> null
      - key           = (sensitive value) -> null
      - preauthorized = true -> null
      - reusable      = false -> null
      - tags          = [
          - "tag:komodo-periphery",
        ] -> null
        # (2 unchanged attributes hidden)
    }

  # tailscale_tailnet_key.tailscale_key will be created
  + resource "tailscale_tailnet_key" "tailscale_key" {
      + created_at    = (known after apply)
      + ephemeral     = false
      + expires_at    = (known after apply)
      + expiry        = 600
      + id            = (known after apply)
      + invalid       = (known after apply)
      + key           = (sensitive value)
      + preauthorized = true
      + reusable      = false
      + tags          = [
          + "tag:web-ingress",
        ]
      + user_id       = (known after apply)
    }

  # module.coreos-periphery-vm.htpasswd_password.password_hash will be destroyed
  # (because htpasswd_password.password_hash is not in configuration)
  - resource "htpasswd_password" "password_hash" {
      - apr1     = "$apr1$C/7XZWy4$SBLQbFjVuQrXTNbANHPp/0" -> null
      - bcrypt   = "$2a$10$1WsH8QY4RDcDQoeoZSI7o.0V3M8uwqVV3ft5p5KqXVmofcFNQqvdW" -> null
      - id       = "PW24326124313024315773483851593452446344516f656f5a5349376f2e3056334d3875777156563366743570354b7158566d6f6663464e5171766457" -> null
      - password = (sensitive value) -> null
      - sha256   = "5d83535eb8c55d4747c0bc670e0897e9cc98ee53592f5131a0a9b68f59d7fe9e" -> null
      - sha512   = "$6$$hqSgrdfOzV1bASEpb57MUpMiaLa6HGTiVMXaCuIssHXTGPgDTQDhLouYki9Ny9NPrr/jRFnWOgdGiVui1dm8t/" -> null
    }

  # module.coreos-periphery-vm.proxmox_virtual_environment_file.cloud_user_config will be destroyed
  # (because proxmox_virtual_environment_file.cloud_user_config is not in configuration)
  - resource "proxmox_virtual_environment_file" "cloud_user_config" {
      - content_type   = "snippets" -> null
      - datastore_id   = "snippets" -> null
      - file_name      = "120830cf.butane-ci-user-data.ign" -> null
      - id             = "snippets:snippets/120830cf.butane-ci-user-data.ign" -> null
      - node_name      = "pve1" -> null
      - overwrite      = true -> null
      - timeout_upload = 1800 -> null

      - source_raw {
          - data      = (sensitive value) -> null
          - file_name = "120830cf.butane-ci-user-data.ign" -> null
          - resize    = 0 -> null
        }
    }

  # module.debian13.proxmox_virtual_environment_vm.vm_template will be created
  + resource "proxmox_virtual_environment_vm" "vm_template" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = (known after apply)
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "debian13"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "template",
          + "debian",
        ]
      + template                = true
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 9013

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "writeback"
          + datastore_id      = "zssd"
          + discard           = "on"
          + file_format       = "raw"
          + file_id           = "local:iso/debian-13-generic-amd64.img"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = true
        }

      + initialization {
          + datastore_id         = "zssd"
          + interface            = "ide2"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = "nocloud"
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
        }

      + memory {
          + dedicated      = 1024
          + floating       = 1024
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device (known after apply)

      + vga (known after apply)
    }

  # module.tailscale_butane.terraform_data.butane_snippet_stable[0] will be destroyed
  # (because terraform_data.butane_snippet_stable is not in configuration)
  - resource "terraform_data" "butane_snippet_stable" {
      - id     = "11010a1a-0928-4f2b-eb37-219367cf3978" -> null
      - input  = (sensitive value) -> null
      - output = <<-EOT
            variant: fcos
            version: 1.5.0
            systemd:
              units:
                - name: tailscale-up.service
                  enabled: true
                  contents: |
                    [Unit]
                    Description=Connect to Tailscale
                    After=network-online.target tailscaled.service
                    Wants=network-online.target
                    Requires=tailscaled.service
            
                    [Service]
                    Type=oneshot
                    RemainAfterExit=yes
                    ExecStart=/usr/bin/tailscale up --authkey=tskey-auth-kYJrijByk221CNTRL-RweV1nci7Kc7cKGuUJc4Pc1uuH6cXBbm --advertise-tags=tag:periphery 
                    ExecStartPost=/bin/sh -c 'echo "Tailscale connected successfully" | systemd-cat -t tailscale-up'
                    
                    StandardOutput=journal+console
                    StandardError=journal+console
            
                    [Install]
                    WantedBy=multi-user.target
        EOT -> null
    }

  # module.ubuntu22.proxmox_virtual_environment_vm.vm_template will be created
  + resource "proxmox_virtual_environment_vm" "vm_template" {
      + acpi                    = true
      + bios                    = "seabios"
      + description             = (known after apply)
      + id                      = (known after apply)
      + ipv4_addresses          = (known after apply)
      + ipv6_addresses          = (known after apply)
      + keyboard_layout         = "en-us"
      + mac_addresses           = (known after apply)
      + machine                 = "q35"
      + migrate                 = false
      + name                    = "ubuntu22"
      + network_interface_names = (known after apply)
      + node_name               = "pve1"
      + on_boot                 = true
      + protection              = false
      + reboot                  = false
      + reboot_after_update     = true
      + scsi_hardware           = "virtio-scsi-pci"
      + stop_on_destroy         = false
      + tablet_device           = true
      + tags                    = [
          + "terraform",
          + "template",
          + "ubuntu",
        ]
      + template                = true
      + timeout_clone           = 1800
      + timeout_create          = 1800
      + timeout_migrate         = 1800
      + timeout_move_disk       = 1800
      + timeout_reboot          = 1800
      + timeout_shutdown_vm     = 1800
      + timeout_start_vm        = 1800
      + timeout_stop_vm         = 300
      + vm_id                   = 8022

      + agent {
          + enabled = true
          + timeout = "15m"
          + trim    = false
          + type    = "virtio"
        }

      + cpu {
          + cores      = 1
          + hotplugged = 0
          + limit      = 0
          + numa       = false
          + sockets    = 1
          + type       = "host"
          + units      = 1024
        }

      + disk {
          + aio               = "io_uring"
          + backup            = true
          + cache             = "writeback"
          + datastore_id      = "zssd"
          + discard           = "on"
          + file_format       = "raw"
          + file_id           = "local:iso/ubuntu-22.04-server-cloudimg-amd64.img"
          + interface         = "scsi0"
          + iothread          = false
          + path_in_datastore = (known after apply)
          + replicate         = true
          + size              = 8
          + ssd               = true
        }

      + initialization {
          + datastore_id         = "zssd"
          + interface            = "ide2"
          + meta_data_file_id    = (known after apply)
          + network_data_file_id = (known after apply)
          + type                 = "nocloud"
          + user_data_file_id    = (known after apply)
          + vendor_data_file_id  = (known after apply)
        }

      + memory {
          + dedicated      = 1024
          + floating       = 1024
          + keep_hugepages = false
          + shared         = 0
        }

      + network_device (known after apply)

      + vga (known after apply)
    }

  # module.vm_minimal_config.proxmox_virtual_environment_file.ci_user_data_file[0] will be created
  + resource "proxmox_virtual_environment_file" "ci_user_data_file" {
      + content_type           = "snippets"
      + datastore_id           = "snippets"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "pve1"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = (sensitive value)
          + file_name = (known after apply)
          + resize    = 0
        }
    }

Plan: 4 to add, 0 to change, 6 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-42-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->